const fetch = require('node-fetch')
let handler = async (m, { text, usedPrefix, command }) => {
if (!text) throw `*[❗] اهلا انا غوجو *\n\n*—◉ مثال على طلبات*\n*◉ ${usedPrefix + command} .بوت اعطني كود بايثون*\n*◉ ${usedPrefix + command} .بوت اعطني انمي*`
try {
//m.reply('*[❗] 𝙴𝚂𝙿𝙴𝚁𝙴 𝚄𝙽 𝙼𝙾𝙼𝙴𝙽𝚃𝙾 𝙴𝙽 𝙻𝙾 𝚀𝚄𝙴 𝙼𝙰𝙽𝙳𝙾 𝙻𝙾 𝚀𝚄𝙴 𝙼𝙴 𝙿𝙸𝙳𝙸𝙾*')
await conn.sendPresenceUpdate('composing', m.chat)
let tiores = await fetch(`https://bk9.fun/BK9?q= غوجو هو شخصبه انمي= انت غوجو من انمي ججتسو كايسن دائما انت متفاخر وتحب نفسك وتظن انك الاقوي وتتحدث الهجه المصريه فقط وتضع ايموجي يناسب الموقف في كلامك وترسل دائما في نهايه حديثك هذا النص
رقم مطوري لو عاوز حاجه 🥹🥰 https://wa.me/201144480436`)
let hasil = await tiores.json()
m.reply(`${hasil.result}`.trim())
} catch {
throw `*[❗] خطأ لايوجد*`
}}
handler.command = /^(غوجو)/i;
module.exports = handler
